[
  {
    "id": "vigile-ai",
    "images": [
      "./assets/projects/vigile-ai/main.png"
    ],
    "title": "Vigile AI",
    "description": "Vigile AI is a cutting-edge AI-powered platform designed to monitor and analyze breach data in real-time, providing users with actionable insights and alerts to enhance their security posture.",
    "fullDescription": "Vigile AI is an advanced security platform that leverages artificial intelligence to monitor and analyze breach data in real-time. The platform is designed to provide users with actionable insights and alerts, helping them to enhance their security posture and respond swiftly to potential threats. Key features include real-time data monitoring, AI-driven analysis, customizable alert systems, and comprehensive reporting tools. Vigile AI aims to empower organizations to stay ahead of cyber threats by providing them with the tools they need to protect their digital assets effectively.",
    "codeLink": "https://vigile.ai/",
    "demoLink": "https://vigile.ai/"
  },
  {
    "id": "artours",
    "images": [
      "./assets/projects/artours/main.png"
    ],
    "title": "ArtOurs",
    "description": "Art Buying and Selling Site made Using Django",
    "fullDescription": "ArtOurs is a comprehensive art marketplace platform built with Django. It enables artists to showcase and sell their artwork while providing art enthusiasts with a seamless browsing and purchasing experience. Features include user authentication, artwork galleries, shopping cart, secure payment integration, and an admin panel for managing listings.",
    "codeLink": "https://github.com/fuunshi/ArtOurs",
    "demoLink": "https://fuunshi.pythonanywhere.com"
  },
  {
    "id": "scrape-data",
    "images": [
      "./assets/projects/scrape-data/main.png"
    ],
    "title": "Share Sansar Data Scrape",
    "description": "Daily Scrapping of data at set time using Scrapy and Github Actions",
    "fullDescription": "An automated web scraping solution that collects daily stock market data from Share Sansar using Scrapy framework. The project utilizes GitHub Actions for scheduled scraping, ensuring data is collected consistently at set times. The scraped data is processed and stored for analysis, providing valuable insights into market trends.",
    "codeLink": "https://github.com/fuunshi/ShareSansarDataScrape",
    "demoLink": "https://github.com/fuunshi/ShareSansarDataScrape"
  }
]